use lviv_croissant;
-- 1
insert into head_office 
  (id_head,name, phone, address, bank_name, bank_no) 
values
  (1,'Головний офіс "Львівські Круасани"', '+380971234567', 'Вулиця Наливайка, 45а', 'АТ "Ощадбанк"', '4734 2312 2893 2333');
  -- 2
insert into shops
  (id_shops,name, address)
values
  (1,'Львівські Круасани №1', 'Вулиця Володимира Великого, 2'),
  (2,'Львівські Круасани №2', 'Площа Ринок, 14'),
  (3,'Львівські Круасани №3', 'Проспект Шевченка, 8');
-- 3
insert into staff
  (id_staff,name, phone, address, position, salary, id_shops)
values
  (1,'Бремен Максим', '+380502679092', 'Вулиця Музична, 7', 'Кухар-продавець', '15000',1),
  (2,'Троян Людмила', '+380673631576', 'Вулиця Технологічна, 101', 'Менеджер', '18000', 1),
  (3,'Франченко Сергій', '+380963421655', 'Вулиця Шевченка, 232', 'Кухар-продавець', '15000',2),
  (4,'Пес Анастасія', '+380992165634', 'Вулиця Польова, 8', 'Менеджер', '18000', 2),
  (5,'Штірліц Андрій', '+380988402075', 'Вулиця Німецька, 62', 'Кухар-продавець', '15000', 3),
  (6,'Зуб Афанасій', '+380671303575', 'Вулиця Наукова, 115', 'Менеджер', '18000', 3);
 -- 4
insert into ingredients
  (id_ingr,name, price)
values
  (1,'Борошно', '80'),
  (2,'Помідор', '65'),
  (3,'Майонез', '60'),
  (4,'Кетчуп', '120'),
  (5,'Філе куряче', '120'),
  (6,'Салат', '50'),
  (7,'Гриби', '100'),
  (8,'Шинка', '160'),
  (9,'Огірок', '30'),
  (10,'Шоколад', '220'),
  (11,'Банан', '70');
-- 5
insert into products
  (id_prod,name, price)
values
  (1,'Класичний', '30'),
  (2,'Галицький', '35'),
  (3,'Солодкий', '40'),
  (4,'З шинкою', '46');
